## production: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| add    | `aws_rds_cluster_parameter_group.postgres16` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.postgres16 will be created
  + resource "aws_rds_cluster_parameter_group" "postgres16" {
      + arn         = (known after apply)
      + description = "RDS customized cluster parameter group"
      + family      = "aurora-postgresql16"
      + id          = (known after apply)
      + name        = "rds-cluster-pg-16"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-production"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_disconnections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_error_statement"
          + value        = "debug5"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_statement"
          + value        = "ddl"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.log_retention_period"
          + value        = "4320"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.logical_replication"
          + value        = "1"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.low-db-memory-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.low-db-memory-critical[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
